tap "enigmaticdb/super-secret-tap"
tap "finnvoor/tools"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# General-purpose data compression with high compression ratio
brew "xz"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Bash Automated Testing System
brew "bats-core"
# Parser generator
brew "bison"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# HTTP/2 C Library
brew "libnghttp2"
# Emacs dependency management
brew "cask"
# Ruby environment tool
brew "chruby"
# Command-line interface built-in Visual Studio Code
brew "code-cli"
# Tool for managing dock items
brew "dockutil"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Command-line interface for qBittorrent written in Go
brew "qbittorrent-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Programmatically correct mistyped console commands
brew "thefuck"
# Ncurses-based klondike solitaire game
brew "tty-solitaire"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Metal-powered video upscaling
brew "finnvoor/tools/fx-upscale"
# Command-line interface for 1Password
cask "1password-cli"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Menu bar icon organiser
cask "bartender"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Mounts cloud storages as local discs
cask "cloudmounter"
# GUI companion app for Homebrew
cask "cork"
# Native document editor
cask "craft"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Productivity app
cask "dropzone"
# Desktop client for Ente Auth
cask "ente-auth"
# Web browser
cask "firefox"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-source-code-pro"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Open-source video transcoder
cask "handbrake"
# Block nags to accept cookies and privacy invasive tracking in Safari
cask "hush"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Keyboard customiser
cask "karabiner-elements"
# Find shortcuts for any installed application
cask "keyclu"
# GPU-based terminal emulator
cask "kitty"
# Utility that shows the latest app updates
cask "latest"
# App to manage software development and track bugs
cask "linear-linear"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# VPN client
cask "mullvadvpn"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Enable Windows-like program quitting when all windows are closed
cask "swift-quit"
# Mesh VPN based on WireGuard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Rust-based terminal
cask "warp"
# Terminal emulator
cask "wave"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bakery", id: 1575220747
mas "Ice Cubes", id: 6444915884
mas "Infuse", id: 1136220934
mas "Numbers", id: 409203825
mas "Refined GitHub", id: 1519867270
mas "TestFlight", id: 899247664
mas "Transmit", id: 1436522307
mas "Xcode", id: 497799835
vscode "[2024-09-04 00:03:23] info searching for installations on your machine, this is done once and will take about 10 seconds..."
vscode "[2024-09-04 00:03:23] warn error looking up installed applications: no such file or directory (os error 2)"
vscode "no installation of code oss was found."
vscode ""
vscode "if you already installed code and we didn't detect it, run `code version use oss --install-dir /path/to/installation`"
