tap "enigmaticdb/super-secret-tap"
tap "finnvoor/tools"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# General-purpose data compression with high compression ratio
brew "xz"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Library for command-line editing
brew "readline"
# Automatically formats Python code to conform to the PEP 8 style guide
brew "autopep8"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Bash Automated Testing System
brew "bats-core"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# HTTP/2 C Library
brew "libnghttp2"
# Emacs dependency management
brew "cask"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Command-line interface built-in Visual Studio Code
brew "code-cli"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Tool for managing dock items
brew "dockutil"
# Command-line DNS Client for Humans
brew "doggo"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Language server for the Go language
brew "gopls"
# Tool to convert a Wallpaper's color scheme / palette
brew "gowall"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Keep your Mac's application settings in sync
brew "mackup"
# Utility for directing compilation
brew "make"
# Platform built on V8 to build network applications
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Mac App Store command-line interface
brew "mas"
# Styled terminal markdown viewer
brew "mdv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Find/fix obsolete Nerd Font icons
brew "nerdfix"
# Send push notifications to your phone or desktop via PUT/POST
brew "ntfy"
# Modern shell for the GitHub era
brew "nushell"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Paste PNG into files
brew "pngpaste"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Terminal slideshow tool
brew "presenterm"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Command-line interface for qBittorrent written in Go
brew "qbittorrent-cli"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Simple terminal UI for search and replace
brew "serpl"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line tool to customize Spotify client
brew "spicetify-cli"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Ncurses-based klondike solitaire game
brew "tty-solitaire"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Vulkan ICD Loader
brew "vulkan-loader"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Metal-powered video upscaling
brew "finnvoor/tools/fx-upscale"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Menu bar icon organiser
cask "bartender"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Mounts cloud storages as local discs
cask "cloudmounter"
# GUI companion app for Homebrew
cask "cork"
# Native document editor
cask "craft"
# Server and cloud storage browser
cask "cyberduck"
# Virtual monitor for screen sharing
cask "deskpad"
# App to build and share containerised applications and microservices
cask "docker"
# Productivity app
cask "dropzone"
# Desktop client for Ente Auth
cask "ente-auth"
# Web browser
cask "firefox"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-source-code-pro"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Open-source video transcoder
cask "handbrake"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Block nags to accept cookies and privacy invasive tracking in Safari
cask "hush"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Keyboard customiser
cask "karabiner-elements"
# Find shortcuts for any installed application
cask "keyclu"
# GPU-based terminal emulator
cask "kitty"
# Utility that shows the latest app updates
cask "latest"
# Custom Discord client
cask "legcord"
# App to manage software development and track bugs
cask "linear-linear"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# VPN client
cask "mullvadvpn"
# Privacy-focused note taking app
cask "notesnook"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# WebKit based web browser
cask "orion"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Open source virtual/remote desktop application
cask "rustdesk"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Mesh VPN based on WireGuard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Terminal emulator
cask "wave"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen-browser"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bakery", id: 1575220747
mas "ExcalidrawZ", id: 6636493997
mas "Ice Cubes", id: 6444915884
mas "Infuse", id: 1136220934
mas "Numbers", id: 409203825
mas "Refined GitHub", id: 1519867270
mas "Solitaire Epic", id: 972224785
mas "TestFlight", id: 899247664
mas "Transmit", id: 1436522307
mas "Xcode", id: 497799835
vscode "[2025-04-18 00:00:47] info searching for installations on your machine, this is done once and will take about 10 seconds..."
vscode "no installation of code oss was found."
vscode ""
vscode "if you already installed code and we didn't detect it, run `code version use oss --install-dir /path/to/installation`"
