tap "enigmaticdb/super-secret-tap"
tap "finnvoor/tools"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# General-purpose data compression with high compression ratio
brew "xz"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Bash Automated Testing System
brew "bats-core"
# Parser generator
brew "bison"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# HTTP/2 C Library
brew "libnghttp2"
# Emacs dependency management
brew "cask"
# Ruby environment tool
brew "chruby"
# Tool for managing dock items
brew "dockutil"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# PNG image optimizing utility
brew "pngquant"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Rust toolchain installer
brew "rustup-init"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Programmatically correct mistyped console commands
brew "thefuck"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Metal-powered video upscaling
brew "finnvoor/tools/fx-upscale"
# Command-line interface for 1Password
cask "1password-cli"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Chromium based browser
cask "arc"
# Menu bar icon organiser
cask "bartender"
# Mounts cloud storages as local discs
cask "cloudmounter"
# The Homebrew Companion
cask "cork"
# Native document editor
cask "craft"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Productivity app
cask "dropzone"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Superfamily of fonts for code
cask "font-monaspace"
# Developer targeted fonts with a high number of glyphs
cask "font-monaspace-nerd-font"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Block nags to accept cookies and privacy invasive tracking in Safari
cask "hush"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Find shortcuts for any installed application
cask "keyclu"
# Utility that shows the latest app updates
cask "latest"
# App to manage software development and track bugs
cask "linear-linear"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Enable Windows-like program quitting when all windows are closed
cask "swift-quit"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Virtual machines UI using QEMU
cask "utm"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bakery", id: 1575220747
mas "Ice Cubes", id: 6444915884
mas "Refined GitHub", id: 1519867270
mas "TestFlight", id: 899247664
mas "Transmit", id: 1436522307
mas "Xcode", id: 497799835
